# Brewfile - Homebrew Bundle for Developer Tools
# Install all tools with: brew bundle

# CLI Tools
brew "gh"                    # GitHub CLI
brew "just"                  # Command runner for justfiles
brew "uv"                    # Python package manager
brew "git"                   # Version control
brew "wget"                  # Network downloader
brew "jq"                    # JSON processor
brew "tree"                  # Directory structure viewer
brew "gemini-cli"            # Gemini CLI
brew "btop"                  # Beautiful Terminal


cask "claude-code"           # Claude Code
cask "visual-studio-code"    # VS Code
cask "docker-desktop"        # Docker Desktop
cask "redis-insight"         # Redis Insight
cask "dbeaver-community"     # DBeaver Community
cask "slack"                 # Slack
cask "mongodb-compass"       # MongoDB Compass
cask "postman"               # Postman
Cask "freelens" 	     # Freelens K8 Cluster Manager
