# Brewfile - Homebrew Bundle for Developer Tools
# Install all tools with: brew bundle

# Taps (Repositories) necessary to further downloads
tap "atlassian/homebrew-acli"

# CLI Tools
brew "gh"                    # GitHub CLI
brew "just"                  # Command runner for justfiles
brew "uv"                    # Python package manager
brew "git"                   # Version control
brew "wget"                  # Network downloader
brew "jq"                    # JSON processor
brew "tree"                  # Directory structure viewer
brew "btop"                  # Beautiful Terminal
brew "opencode"              # Open Code
brew "acli"                  # Atlassian CLI (Jira, Confluence, etc).
brew "starship"              # Starship Beautiful CLI 
brew "awscli"                # AWS CLI

cask "claude-code"           # Claude CLI
cask "codex"                 # Codex CLI
cask "visual-studio-code"    # VSCode
cask "docker-desktop"        # Docker Desktop
cask "redis-insight"         # Redis Insight
cask "dbeaver-community"     # DBeaver Community
cask "mongodb-compass"       # MongoDB Compass
cask "slack"                 # Slack
cask "postman"               # Postman
cask "freelens"              # Freelens K8 Cluster Manager
cask "gcloud-cli"            # Google Cloud CLI


